#!/usr/bin/python3
# -*- coding: UTF-8 -*-

# -------------------------------------------------------------------------
# 程序：Options.py
# 作者：zhangxiaofei
# 日期：2018-04-27
# 功能：选项类
# -------------------------------------------------------------------------

import sys

class Options(object):

  # -----------------------------------------------------------------------
  # 初始化方法

  def __init__(self):

    self.options = {}




  # -----------------------------------------------------------------------
  # 添加选项

  def add(self, flag, callback):

    self.options[flag] = callback




  # -----------------------------------------------------------------------
  # 初始化方法，用于数据初始化

  def execute(self):

    if len(sys.argv) > 2:

      self.options[sys.argv[1]](sys.argv[2])

    else:

      self.options[sys.argv[1]]()
